cfe llm/Enums/AI_ВидУточнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ВидУточнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыборИзПодчиненных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводСтроки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЧисла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Флаг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_ТипЗначенияПоля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ТипЗначенияПоля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ссылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_ВидСравненияОтбора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ВидСравненияОтбора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_МестаЗапускаСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_МестаЗапускаСценариев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйЗапрос</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНесколькоОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаИзвлечения</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_КартыИзвлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ВидДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уточнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУточнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидУточнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСодержимого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитИмениФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередаватьСодержимое</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыКонтекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ВидСравненияОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСтаройОчереди</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗнаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборЗнаний</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_НаборыЗнаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_ИзвлечениеРеквизитов/Ext/Module.bsl
// Универсальное извлечение реквизитов по карте соответствий.
//
// Карта (Справочник.AI_КартыИзвлечения) — единственное место, где описано,
// какие поля модель должна вернуть и куда они ложатся в прикладном объекте.
// Из нее выводится и схема ответа для модели, и таблица рекомендаций.
//
// Модуль не знает ни одного прикладного объекта: и источник вложений,
// и целевые реквизиты задаются полными именами метаданных и читаются
// рефлексией. Запись в прикладной объект здесь не выполняется — ядро
// остается только на чтение, писать должен адаптер после подтверждения.

#Область ПрограммныйИнтерфейс

// Возвращает JSON Schema для поля СхемаОтветаJSON сценария.
// Схема собирается по полям карты, чтобы ответ модели заведомо совпадал
// с тем, что потом раскладывается по реквизитам.
Функция СформироватьСхемуОтвета(Карта) Экспорт

	ПроверитьКарту(Карта);

	Свойства = Новый Соответствие;
	Обязательные = Новый Массив;
	// Поля табличной части собираются в один массив объектов: строк в документе
	// сколько угодно, и плоская схема их выразить не может.
	ГруппыТЧ = Новый Соответствие;

	Для Каждого Поле Из Карта.Поля Цикл
		Ключ = СокрЛП(Поле.Ключ);
		Если Не ЗначениеЗаполнено(Ключ) Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеПоля = Новый Соответствие;
		ОписаниеПоля.Вставить("type", ТипСхемыПоля(Поле.ТипЗначения));
		Описание = ТекстОписанияПоля(Поле);
		Если ЗначениеЗаполнено(Описание) Тогда
			ОписаниеПоля.Вставить("description", Описание);
		КонецЕсли;

		ИмяТЧ = СокрЛП(Поле.ТабличнаяЧасть);
		Если ЗначениеЗаполнено(ИмяТЧ) Тогда
			ГруппаПолей = ГруппыТЧ.Получить(НРег(ИмяТЧ));
			Если ГруппаПолей = Неопределено Тогда
				ГруппаПолей = Новый Структура("Имя,Свойства,Обязательные",
					ИмяТЧ, Новый Соответствие, Новый Массив);
				ГруппыТЧ.Вставить(НРег(ИмяТЧ), ГруппаПолей);
			КонецЕсли;
			ГруппаПолей.Свойства.Вставить(Ключ, ОписаниеПоля);
			ГруппаПолей.Обязательные.Добавить(Ключ);
			Продолжить;
		КонецЕсли;

		Свойства.Вставить(Ключ, ОписаниеПоля);
		// Контракт операций требует строгую схему: все свойства должны быть
		// перечислены в required. Необязательность выражается не схемой, а тем,
		// что модель вернет пустое значение — флаг Обязательное проверяется
		// уже при разборе рекомендаций.
		Обязательные.Добавить(Ключ);
	КонецЦикла;

	// Массив строк лежит под ключом, равным имени табличной части: отдельного
	// имени в карте нет намеренно, иначе настройщику пришлось бы держать в
	// голове два разных названия одного и того же.
	Для Каждого ЭлементГруппы Из ГруппыТЧ Цикл
		ГруппаПолей = ЭлементГруппы.Значение;
		ОписаниеСтроки = Новый Соответствие;
		ОписаниеСтроки.Вставить("type", "object");
		ОписаниеСтроки.Вставить("properties", ГруппаПолей.Свойства);
		ОписаниеСтроки.Вставить("required", ГруппаПолей.Обязательные);
		ОписаниеСтроки.Вставить("additionalProperties", Ложь);

		ОписаниеМассива = Новый Соответствие;
		ОписаниеМассива.Вставить("type", "array");
		ОписаниеМассива.Вставить("items", ОписаниеСтроки);
		ОписаниеМассива.Вставить("description", "Строки табличной части «"
			+ ГруппаПолей.Имя + "». Пустой массив, если в документе их нет.");

		Свойства.Вставить(ГруппаПолей.Имя, ОписаниеМассива);
		Обязательные.Добавить(ГруппаПолей.Имя);
	КонецЦикла;

	Если Свойства.Количество() = 0 Тогда
		ВызватьИсключение "В карте извлечения не заполнено ни одного поля.";
	КонецЕсли;

	Схема = Новый Соответствие;
	Схема.Вставить("type", "object");
	Схема.Вставить("properties", Свойства);
	Схема.Вставить("required", Обязательные);
	Схема.Вставить("additionalProperties", Ложь);

	Возврат ЗаписатьJSONВСтроку(Схема);

КонецФункции

// Записывает схему, собранную по карте, в сценарии, которые используют эту карту.
//
// Контракт операции берет СхемаОтветаJSON из сценария и перетирает переданное
// извне — это правильно, сценарий должен оставаться единственным источником
// правды на момент выполнения. Поэтому схему переносим заранее и явно,
// отдельным действием администратора, а не молча при каждом запуске.
//
// Возвращает структуру: Обновлено, Пропущено, Сообщения (массив строк).
Функция СинхронизироватьСхемуСценариев(Карта) Экспорт

	Результат = Новый Структура("Обновлено,Пропущено,Сообщения", 0, 0, Новый Массив);
	Схема = СформироватьСхемуОтвета(Карта);

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|  Места.Сценарий КАК Сценарий
		|ИЗ Справочник.AI_МестаЗапускаСценариев КАК Места
		|ГДЕ Места.КартаИзвлечения = &Карта
		|  И НЕ Места.ПометкаУдаления
		|  И Места.Сценарий <> ЗНАЧЕНИЕ(Справочник.AI_Сценарии.ПустаяСсылка)");
	Запрос.УстановитьПараметр("Карта", Карта);
	Выборка = Запрос.Выполнить().Выбрать();
	НайденоСценариев = 0;

	Пока Выборка.Следующий() Цикл
		НайденоСценариев = НайденоСценариев + 1;
		Сценарий = Выборка.Сценарий;
		Если Сценарий.СхемаОтветаJSON = Схема Тогда
			Результат.Пропущено = Результат.Пропущено + 1;
			Продолжить;
		КонецЕсли;
		Попытка
			ОбъектСценария = Сценарий.ПолучитьОбъект();
			ОбъектСценария.СхемаОтветаJSON = Схема;
			ОбъектСценария.Записать();
			Результат.Обновлено = Результат.Обновлено + 1;
			Результат.Сообщения.Добавить("Схема записана в сценарий: " + Строка(Сценарий));
		Исключение
			Результат.Сообщения.Добавить(
				"Не удалось записать схему в сценарий " + Строка(Сценарий)
				+ ": " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

	// Сообщение про отсутствие мест запуска уместно только тогда, когда их
	// действительно нет: иначе оно маскирует настоящую ошибку записи.
	Если НайденоСценариев = 0 Тогда
		Результат.Сообщения.Добавить(
			"Ни одно место запуска не ссылается на эту карту — обновлять нечего.");
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает варианты выбора для шага уточнения.
// Источник, связь с контекстным объектом и отбор заданы строками полных имен,
// поэтому ядро не зависит от конкретной конфигурации.
//
// Возвращает таблицу: Ссылка, Представление, Дополнительно.
Функция ПолучитьВариантыУточнения(Уточнение, Контекст) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Дополнительно", Новый ОписаниеТипов("Строка"));

	Источник = СокрЛП(Строка(Уточнение.ИсточникДанных));
	Если Не ЗначениеЗаполнено(Источник) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Метаданные.НайтиПоПолномуИмени(Источник) = Неопределено Тогда
		ВызватьИсключение "Источник данных уточнения не найден в конфигурации: " + Источник;
	КонецЕсли;

	ПодчиненныеКонтексту = (Уточнение.ВидУточнения = Перечисления.AI_ВидУточнения.ВыборИзПодчиненных);
	РеквизитСвязи = СокрЛП(Строка(Уточнение.РеквизитСвязи));
	Владелец = Неопределено;
	Если ПодчиненныеКонтексту Тогда
		Если Не ЗначениеЗаполнено(РеквизитСвязи) Тогда
			ВызватьИсключение "Для выбора из подчиненных не задан реквизит связи.";
		КонецЕсли;
		Владелец = ПолучитьОбъектКонтекста(Контекст);
		Если Владелец = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	РеквизитПредставления = СокрЛП(Строка(Уточнение.РеквизитПредставления));
	ОтборРеквизит = СокрЛП(Строка(Уточнение.ОтборРеквизит));

	Поля = "Источник.Ссылка КАК Ссылка";
	Если ЗначениеЗаполнено(РеквизитПредставления) Тогда
		Поля = Поля + ", Источник." + РеквизитПредставления + " КАК Представление";
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборРеквизит) Тогда
		Поля = Поля + ", Источник." + ОтборРеквизит + " КАК ЗначениеОтбора";
	КонецЕсли;

	Условия = Новый Массив;
	Условия.Добавить("НЕ Источник.ПометкаУдаления");
	Если ПодчиненныеКонтексту Тогда
		Условия.Добавить("Источник." + РеквизитСвязи + " = &Владелец");
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ " + Поля + " ИЗ " + Источник + " КАК Источник"
		+ " ГДЕ " + СтрСоединить(Условия, " И "));
	Если ПодчиненныеКонтексту Тогда
		Запрос.УстановитьПараметр("Владелец", Владелец);
	КонецЕсли;

	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		ВызватьИсключение "Не удалось прочитать варианты уточнения из " + Источник
			+ ": " + ОписаниеОшибки();
	КонецПопытки;

	ОжидаемыеЗначения = РазобратьСписокЗначений(Уточнение.ОтборЗначение);

	Пока Выборка.Следующий() Цикл
		ЗначениеОтбора = "";
		Если ЗначениеЗаполнено(ОтборРеквизит) Тогда
			ЗначениеОтбора = НРег(СокрЛП(Строка(Выборка.ЗначениеОтбора)));
			Если ОжидаемыеЗначения.Количество() > 0
				И ОжидаемыеЗначения.Найти(ЗначениеОтбора) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		СтрокаТаблицы = Результат.Добавить();
		СтрокаТаблицы.Ссылка = Выборка.Ссылка;
		СтрокаТаблицы.Представление = Лев(?(ЗначениеЗаполнено(РеквизитПредставления),
			Строка(Выборка.Представление),
			Строка(Выборка.Ссылка)), 250);
		СтрокаТаблицы.Дополнительно = Лев(ЗначениеОтбора, 100);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает двоичное содержимое прикладного файла для передачи модели.
// Сначала пробуем реквизит-хранилище, заданный администратором: так устроено
// большинство конфигураций. Если его нет или он пуст — отдаем управление
// переопределяемому модулю, где интегратор описывает свой способ хранения
// (например, тома 1С:Документооборота).
//
// Возвращает структуру: Содержимое, ИмяФайла, Получено, Причина.
Функция ПолучитьСодержимоеВложения(Вложение, Уточнение) Экспорт

	Результат = Новый Структура("Содержимое,ИмяФайла,Получено,Причина",
		Неопределено, "", Ложь, "");

	Если Не ЗначениеЗаполнено(Вложение) Тогда
		Результат.Причина = "Не выбран файл.";
		Возврат Результат;
	КонецЕсли;

	Результат.ИмяФайла = СформироватьИмяФайла(Вложение, Уточнение);

	РеквизитСодержимого = СокрЛП(Строка(Уточнение.РеквизитСодержимого));
	Если ЗначениеЗаполнено(РеквизитСодержимого) Тогда
		Содержимое = ПрочитатьСодержимоеИзРеквизита(Вложение, РеквизитСодержимого);
		Если Содержимое <> Неопределено Тогда
			Результат.Содержимое = Содержимое;
			Результат.Получено = Истина;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	Содержимое = Неопределено;
	ИмяИзОбработчика = Результат.ИмяФайла;
	Обработано = Ложь;
	Попытка
		AI_ВложенияПереопределяемый.ПриПолученииСодержимогоВложения(
			Вложение,
			Уточнение,
			Содержимое,
			ИмяИзОбработчика,
			Обработано);
	Исключение
		Результат.Причина = "Переопределяемый обработчик завершился с ошибкой: "
			+ ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;

	Если Обработано И ТипЗнч(Содержимое) = Тип("ДвоичныеДанные") Тогда
		Результат.Содержимое = Содержимое;
		Результат.ИмяФайла = ?(ЗначениеЗаполнено(ИмяИзОбработчика),
			ИмяИзОбработчика, Результат.ИмяФайла);
		Результат.Получено = Истина;
		Возврат Результат;
	КонецЕсли;

	Результат.Причина = "Не удалось получить содержимое файла."
		+ " Укажите реквизит хранилища в уточнении либо реализуйте"
		+ " AI_ВложенияПереопределяемый.ПриПолученииСодержимогоВложения.";
	Возврат Результат;

КонецФункции

// Ссылка на прикладной объект контекста по полному имени метаданных и UUID.
// Нужна и чтению, и записи, поэтому вынесена в программный интерфейс.
Функция ПолучитьОбъектПоКонтексту(Контекст) Экспорт

	Возврат ПолучитьОбъектКонтекста(Контекст);

КонецФункции

// Истина, если контекстный объект проходит дополнительные отборы места запуска.
// Отборы позволяют разделить действия внутри одного типа объекта:
// например, показывать проверку договора только документам вида «Договор».
Функция ПроверитьОтборыКонтекста(МестоЗапуска, Контекст) Экспорт

	Если МестоЗапуска.ОтборыКонтекста.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	Объект = ПолучитьОбъектКонтекста(Контекст);
	Если Объект = Неопределено Тогда
		// Отбор задан, а объекта нет — действие к такому контексту не относится.
		Возврат Ложь;
	КонецЕсли;

	Для Каждого Отбор Из МестоЗапуска.ОтборыКонтекста Цикл
		Путь = СокрЛП(Строка(Отбор.ПутьРеквизита));
		Если Не ЗначениеЗаполнено(Путь) Тогда
			Продолжить;
		КонецЕсли;
		Значение = ПрочитатьПоПути(Объект, Путь);
		Если Не ПроверитьУсловиеОтбора(Значение, Отбор) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

// Раскладывает ответ модели по полям карты.
// Возвращает таблицу рекомендаций для предпросмотра: адаптер показывает ее
// пользователю и только после подтверждения пишет значения в объект.
//
// Колонки: Ключ, Представление, ПутьРеквизита, ТипЗначения, ЗначениеМодели,
//          Значение, Распознано, Комментарий.
Функция РазобратьРекомендации(Карта, ТекстОтвета) Экспорт

	ПроверитьКарту(Карта);

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПутьРеквизита", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТабличнаяЧасть", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ДополнительныйРеквизит", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТипЗначения");
	Результат.Колонки.Добавить("ЗначениеМодели", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Значение");
	Результат.Колонки.Добавить("Распознано", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));

	Данные = ПрочитатьОтвет(ТекстОтвета);

	РазобратьСтрокиТабличныхЧастей(Карта, Данные, Результат);

	Для Каждого Поле Из Карта.Поля Цикл
		Ключ = СокрЛП(Поле.Ключ);
		Если Не ЗначениеЗаполнено(Ключ) Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СокрЛП(Поле.ТабличнаяЧасть)) Тогда
			// Строки табличных частей разобраны выше: у них свой обход.
			Продолжить;
		КонецЕсли;

		СтрокаТаблицы = Результат.Добавить();
		СтрокаТаблицы.Ключ = Ключ;
		СтрокаТаблицы.Представление = ?(ЗначениеЗаполнено(Поле.Представление), Поле.Представление, Ключ);
		СтрокаТаблицы.ПутьРеквизита = СокрЛП(Поле.ПутьРеквизита);
		СтрокаТаблицы.ДополнительныйРеквизит = СокрЛП(Поле.ДополнительныйРеквизит);
		СтрокаТаблицы.ТипЗначения = Поле.ТипЗначения;

		Сырое = Данные.Получить(Ключ);
		Если Сырое = Неопределено Или Сырое = Null Тогда
			// Схема строгая, поэтому пустое значение — штатный способ сказать
			// «в документе этого нет». Для обязательного поля это проблема.
			СтрокаТаблицы.Комментарий = ?(Поле.Обязательное,
				"Обязательное поле не заполнено моделью.",
				"Модель не вернула значение.");
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы.ЗначениеМодели = Лев(Строка(Сырое), 500);

		Преобразование = ПреобразоватьЗначение(Сырое, Поле);
		СтрокаТаблицы.Значение = Преобразование.Значение;
		СтрокаТаблицы.Распознано = Преобразование.Успех;
		СтрокаТаблицы.Комментарий = Преобразование.Комментарий;
		Если Не Преобразование.Успех И Поле.Обязательное Тогда
			СтрокаТаблицы.Комментарий = "Обязательное поле. " + Преобразование.Комментарий;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Раскладывает массивы строк табличных частей в плоские строки результата.
//
// Модель возвращает их массивом под ключом, равным имени табличной части.
// Нумерация строк сквозная по массиву: по ней применение собирает строки
// обратно, поэтому терять ее нельзя.
Процедура РазобратьСтрокиТабличныхЧастей(Карта, Данные, Результат)

	ГруппыПолей = Новый Соответствие;
	Для Каждого Поле Из Карта.Поля Цикл
		ИмяТЧ = СокрЛП(Поле.ТабличнаяЧасть);
		Если Не ЗначениеЗаполнено(ИмяТЧ) Или Не ЗначениеЗаполнено(СокрЛП(Поле.Ключ)) Тогда
			Продолжить;
		КонецЕсли;
		СписокПолей = ГруппыПолей.Получить(НРег(ИмяТЧ));
		Если СписокПолей = Неопределено Тогда
			СписокПолей = Новый Массив;
			ГруппыПолей.Вставить(НРег(ИмяТЧ), СписокПолей);
		КонецЕсли;
		СписокПолей.Добавить(Поле);
	КонецЦикла;

	Для Каждого ЭлементГруппы Из ГруппыПолей Цикл
		СписокПолей = ЭлементГруппы.Значение;
		ИмяТЧ = СокрЛП(СписокПолей[0].ТабличнаяЧасть);

		СтрокиОтвета = ЗначениеПоКлючуБезРегистра(Данные, ИмяТЧ);
		Если ТипЗнч(СтрокиОтвета) <> Тип("Массив") Тогда
			// Массива нет — модель не нашла строк. Говорим об этом один раз на
			// табличную часть, а не по разу на каждое поле.
			СтрокаТаблицы = Результат.Добавить();
			СтрокаТаблицы.Ключ = ИмяТЧ;
			СтрокаТаблицы.Представление = "Табличная часть «" + ИмяТЧ + "»";
			СтрокаТаблицы.ТабличнаяЧасть = ИмяТЧ;
			СтрокаТаблицы.Комментарий = "Модель не вернула строк табличной части.";
			Продолжить;
		КонецЕсли;

		Номер = 0;
		Для Каждого СтрокаОтвета Из СтрокиОтвета Цикл
			Номер = Номер + 1;
			Для Каждого Поле Из СписокПолей Цикл
				Ключ = СокрЛП(Поле.Ключ);
				СтрокаТаблицы = Результат.Добавить();
				СтрокаТаблицы.Ключ = Ключ;
				СтрокаТаблицы.ТабличнаяЧасть = ИмяТЧ;
				СтрокаТаблицы.НомерСтроки = Номер;
				СтрокаТаблицы.ПутьРеквизита = СокрЛП(Поле.ПутьРеквизита);
				СтрокаТаблицы.ТипЗначения = Поле.ТипЗначения;
				СтрокаТаблицы.Представление = СтрШаблон("%1 [%2]: %3",
					ИмяТЧ,
					Номер,
					?(ЗначениеЗаполнено(Поле.Представление), Поле.Представление, Ключ));

				Сырое = Неопределено;
				Если ТипЗнч(СтрокаОтвета) = Тип("Соответствие") Тогда
					Сырое = ЗначениеПоКлючуБезРегистра(СтрокаОтвета, Ключ);
				КонецЕсли;
				Если Сырое = Неопределено Или Сырое = Null Тогда
					СтрокаТаблицы.Комментарий = ?(Поле.Обязательное,
						"Обязательное поле строки не заполнено моделью.",
						"Модель не вернула значение.");
					Продолжить;
				КонецЕсли;

				СтрокаТаблицы.ЗначениеМодели = Лев(Строка(Сырое), 500);
				Преобразование = ПреобразоватьЗначение(Сырое, Поле);
				СтрокаТаблицы.Значение = Преобразование.Значение;
				СтрокаТаблицы.Распознано = Преобразование.Успех;
				СтрокаТаблицы.Комментарий = Преобразование.Комментарий;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Ключи в ответе приходят как в схеме, но регистр модель иногда меняет.
Функция ЗначениеПоКлючуБезРегистра(Данные, Ключ)

	Если ТипЗнч(Данные) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Точное = Данные.Получить(Ключ);
	Если Точное <> Неопределено Тогда
		Возврат Точное;
	КонецЕсли;
	Искомый = НРег(Ключ);
	Для Каждого Элемент Из Данные Цикл
		Если НРег(Строка(Элемент.Ключ)) = Искомый Тогда
			Возврат Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции

Процедура ПроверитьКарту(Карта)
	Если ТипЗнч(Карта) <> Тип("СправочникСсылка.AI_КартыИзвлечения")
		Или Не ЗначениеЗаполнено(Карта) Тогда
		ВызватьИсключение "Не указана карта извлечения реквизитов.";
	КонецЕсли;
	Если Карта.ПометкаУдаления Или Не Карта.Активна Тогда
		ВызватьИсключение "Карта извлечения недоступна: " + Строка(Карта);
	КонецЕсли;
КонецПроцедуры

Функция ТипСхемыПоля(ТипЗначения)
	Если ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Число Тогда
		Возврат "number";
	ИначеЕсли ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Булево Тогда
		Возврат "boolean";
	КонецЕсли;
	// Дата и ссылка приходят строкой: дата в ISO, ссылка — представлением.
	Возврат "string";
КонецФункции

Функция ТекстОписанияПоля(Поле)
	Части = Новый Массив;
	Если ЗначениеЗаполнено(Поле.Подсказка) Тогда
		Части.Добавить(СокрЛП(Поле.Подсказка));
	КонецЕсли;
	Если Поле.ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Дата Тогда
		Части.Добавить("Формат даты: ГГГГ-ММ-ДД.");
	КонецЕсли;
	Если Поле.ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Ссылка Тогда
		Части.Добавить("Вернуть наименование как в документе.");
	КонецЕсли;
	Возврат СтрСоединить(Части, " ");
КонецФункции

Функция ПолучитьОбъектКонтекста(Контекст)

	Если ТипЗнч(Контекст) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПолноеИмя = "";
	Ключ = "";
	Контекст.Свойство("ПолноеИмяМетаданных", ПолноеИмя);
	Контекст.Свойство("КлючИсточника", Ключ);
	ПолноеИмя = СокрЛП(Строка(ПолноеИмя));
	Ключ = СокрЛП(Строка(Ключ));
	Если Не ЗначениеЗаполнено(ПолноеИмя) Или Не ЗначениеЗаполнено(Ключ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Описание = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Если Описание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Менеджер = МенеджерПоПолномуИмени(ПолноеИмя);
		Возврат Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Ключ));
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Менеджер объекта по полному имени метаданных.
// Реализовано платформенными средствами, без ОбщегоНазначения БСП:
// расширение должно работать и в конфигурациях без БСП.
Функция МенеджерПоПолномуИмени(ПолноеИмя) Экспорт

	Части = СтрРазделить(ПолноеИмя, ".");
	Если Части.Количество() < 2 Тогда
		ВызватьИсключение "Некорректное полное имя метаданных: " + ПолноеИмя;
	КонецЕсли;
	Вид = ВРег(Части[0]);
	Имя = Части[1];

	Если Вид = ВРег("Справочник") Тогда
		Возврат Справочники[Имя];
	ИначеЕсли Вид = ВРег("Документ") Тогда
		Возврат Документы[Имя];
	ИначеЕсли Вид = ВРег("Перечисление") Тогда
		Возврат Перечисления[Имя];
	ИначеЕсли Вид = ВРег("ПланВидовХарактеристик") Тогда
		Возврат ПланыВидовХарактеристик[Имя];
	ИначеЕсли Вид = ВРег("ПланСчетов") Тогда
		Возврат ПланыСчетов[Имя];
	ИначеЕсли Вид = ВРег("ПланВидовРасчета") Тогда
		Возврат ПланыВидовРасчета[Имя];
	ИначеЕсли Вид = ВРег("БизнесПроцесс") Тогда
		Возврат БизнесПроцессы[Имя];
	ИначеЕсли Вид = ВРег("Задача") Тогда
		Возврат Задачи[Имя];
	КонецЕсли;
	ВызватьИсключение "Неподдерживаемый вид метаданных: " + ПолноеИмя;

КонецФункции

// Читает значение по пути вида "Реквизит" или "Реквизит.Реквизит".
Функция ПрочитатьПоПути(Объект, Путь)
	Текущее = Объект;
	Для Каждого Часть Из СтрРазделить(Путь, ".") Цикл
		Часть = СокрЛП(Часть);
		Если Не ЗначениеЗаполнено(Часть) Или Текущее = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Попытка
			Текущее = Текущее[Часть];
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЦикла;
	Возврат Текущее;
КонецФункции

Функция ПроверитьУсловиеОтбора(Значение, Отбор)

	Вид = Отбор.ВидСравнения;
	Если Вид = Перечисления.AI_ВидСравненияОтбора.Заполнено Тогда
		Возврат ЗначениеЗаполнено(Значение);
	ИначеЕсли Вид = Перечисления.AI_ВидСравненияОтбора.НеЗаполнено Тогда
		Возврат Не ЗначениеЗаполнено(Значение);
	КонецЕсли;

	// Сравнение идет по представлению: в отборе администратор пишет текст,
	// а не ссылку, иначе ядро зависело бы от типов прикладной конфигурации.
	Фактическое = НРег(СокрЛП(Строка(Значение)));
	Ожидаемые = РазобратьСписокЗначений(Отбор.Значение);
	Совпало = (Ожидаемые.Найти(Фактическое) <> Неопределено);

	Если Вид = Перечисления.AI_ВидСравненияОтбора.НеРавно Тогда
		Возврат Не Совпало;
	КонецЕсли;
	Возврат Совпало;

КонецФункции

// Разбирает перечисление значений через запятую в нижнем регистре.
Функция РазобратьСписокЗначений(Значение)
	Результат = Новый Массив;
	Текст = НРег(СокрЛП(Строка(Значение)));
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Результат;
	КонецЕсли;
	Для Каждого Часть Из СтрРазделить(Текст, ",") Цикл
		Часть = СокрЛП(Часть);
		Если ЗначениеЗаполнено(Часть) И Результат.Найти(Часть) = Неопределено Тогда
			Результат.Добавить(Часть);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция СформироватьИмяФайла(Вложение, Уточнение)

	Имя = "";
	РеквизитИмени = СокрЛП(Строка(Уточнение.РеквизитИмениФайла));
	Если ЗначениеЗаполнено(РеквизитИмени) Тогда
		Имя = СокрЛП(Строка(ПрочитатьПоПути(Вложение, РеквизитИмени)));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Имя = СокрЛП(Строка(Вложение));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Имя = "attachment";
	КонецЕсли;

	// Расширение нужно модели, чтобы понять формат вложения.
	Если СтрНайти(Имя, ".") = 0 Тогда
		РеквизитРасширения = СокрЛП(Строка(Уточнение.ОтборРеквизит));
		Расширение = "";
		Если ЗначениеЗаполнено(РеквизитРасширения) Тогда
			Расширение = НРег(СокрЛП(Строка(ПрочитатьПоПути(Вложение, РеквизитРасширения))));
			Расширение = СтрЗаменить(Расширение, ".", "");
		КонецЕсли;
		Если ЗначениеЗаполнено(Расширение) Тогда
			Имя = Имя + "." + Расширение;
		КонецЕсли;
	КонецЕсли;
	Возврат Лев(Имя, 250);

КонецФункции

Функция ПрочитатьСодержимоеИзРеквизита(Вложение, РеквизитСодержимого)

	Значение = ПрочитатьПоПути(Вложение, РеквизитСодержимого);
	Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
		Значение = Значение.Получить();
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		Возврат Значение;
	КонецЕсли;
	// Реквизит может хранить извлеченный текст — его тоже отдаем модели файлом.
	Если ТипЗнч(Значение) = Тип("Строка") И ЗначениеЗаполнено(Значение) Тогда
		Возврат ПолучитьДвоичныеДанныеИзСтроки(Значение);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция ПрочитатьОтвет(ТекстОтвета)

	Текст = СокрЛП(Строка(ТекстОтвета));
	Если Не ЗначениеЗаполнено(Текст) Тогда
		ВызватьИсключение "Модель вернула пустой ответ.";
	КонецЕсли;
	Если СтрДлина(Текст) > 1000000 Тогда
		ВызватьИсключение "Ответ модели превышает 1 МБ символов.";
	КонецЕсли;
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Текст);
		Данные = ПрочитатьJSON(Чтение, Истина);
	Исключение
		ВызватьИсключение "Ответ модели не является корректным JSON: " + ОписаниеОшибки();
	КонецПопытки;
	Если ТипЗнч(Данные) <> Тип("Соответствие") Тогда
		ВызватьИсключение "Корнем ответа модели должен быть объект JSON.";
	КонецЕсли;
	Возврат Данные;

КонецФункции

Функция ПреобразоватьЗначение(Сырое, Поле)

	Результат = Новый Структура("Значение,Успех,Комментарий", Неопределено, Ложь, "");

	Если Поле.ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Число Тогда
		Попытка
			Результат.Значение = Число(СтрЗаменить(СтрЗаменить(Строка(Сырое), " ", ""), ",", "."));
			Результат.Успех = Истина;
		Исключение
			Результат.Комментарий = "Не удалось преобразовать в число.";
		КонецПопытки;

	ИначеЕсли Поле.ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Булево Тогда
		Результат.Значение = ПреобразоватьВБулево(Сырое, Результат);

	ИначеЕсли Поле.ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Дата Тогда
		Результат.Значение = ПреобразоватьВДату(Сырое, Результат);

	ИначеЕсли Поле.ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Ссылка Тогда
		Результат.Значение = НайтиСсылку(Строка(Сырое), Поле, Результат);

	Иначе
		Результат.Значение = Строка(Сырое);
		Результат.Успех = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ПреобразоватьВБулево(Сырое, Результат)
	Если ТипЗнч(Сырое) = Тип("Булево") Тогда
		Результат.Успех = Истина;
		Возврат Сырое;
	КонецЕсли;
	Текст = НРег(СокрЛП(Строка(Сырое)));
	Если СтрНайти(",да,истина,true,1,yes,", "," + Текст + ",") > 0 Тогда
		Результат.Успех = Истина;
		Возврат Истина;
	ИначеЕсли СтрНайти(",нет,ложь,false,0,no,", "," + Текст + ",") > 0 Тогда
		Результат.Успех = Истина;
		Возврат Ложь;
	КонецЕсли;
	Результат.Комментарий = "Не удалось определить логическое значение.";
	Возврат Неопределено;
КонецФункции

Функция ПреобразоватьВДату(Сырое, Результат)
	Если ТипЗнч(Сырое) = Тип("Дата") Тогда
		Результат.Успех = Истина;
		Возврат Сырое;
	КонецЕсли;
	Текст = СокрЛП(Строка(Сырое));
	// Ожидаем ISO ГГГГ-ММ-ДД: именно этот формат заявлен модели в схеме.
	Цифры = "";
	Для Позиция = 1 По СтрДлина(Текст) Цикл
		Символ = Сред(Текст, Позиция, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(Цифры) < 8 Тогда
		Результат.Комментарий = "Не удалось разобрать дату.";
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Результат.Значение = Дата(Лев(Цифры, 8));
		Результат.Успех = Истина;
		Возврат Результат.Значение;
	Исключение
		Результат.Комментарий = "Не удалось разобрать дату.";
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// Поиск ссылки идет по полному имени метаданных из карты — рефлексией,
// поэтому ядро не связано с конкретными справочниками конфигурации.
Функция НайтиСсылку(Представление, Поле, Результат)

	ПолноеИмя = СокрЛП(Строка(Поле.ТипСсылки));
	Текст = СокрЛП(Представление);
	Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
		Результат.Комментарий = "В карте не указан тип ссылки.";
		Возврат Неопределено;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Результат.Комментарий = "Модель вернула пустое представление.";
		Возврат Неопределено;
	КонецЕсли;
	Если Метаданные.НайтиПоПолномуИмени(ПолноеИмя) = Неопределено Тогда
		Результат.Комментарий = "Тип ссылки не найден в конфигурации: " + ПолноеИмя;
		Возврат Неопределено;
	КонецЕсли;
	Если Не Поле.ПоискПоНаименованию Тогда
		Результат.Комментарий = "Поиск по наименованию отключен, значение требует ручного выбора.";
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Менеджер = МенеджерПоПолномуИмени(ПолноеИмя);
		Ссылка = Менеджер.НайтиПоНаименованию(Текст, Истина);
	Исключение
		Результат.Комментарий = "Поиск по наименованию не поддержан для " + ПолноеИмя;
		Возврат Неопределено;
	КонецПопытки;

	Если ЗначениеЗаполнено(Ссылка) Тогда
		Результат.Успех = Истина;
		Возврат Ссылка;
	КонецЕсли;
	Результат.Комментарий = "Не найдено в " + ПолноеИмя + ": " + Текст;
	Возврат Неопределено;

КонецФункции

Функция ЗаписатьJSONВСтроку(Значение)
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Значение);
	Возврат Запись.Закрыть();
КонецФункции

#КонецОбласти
